Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/ВремяДоступаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяДоступаПользователейСУО</name>
  <attributes>
    <name>ДатаНачалаДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДоступа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВремяДоступаПользователейСУО/Forms/ФормаУстановкаВремени/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьФорматРедактированияВремени();
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СкрытьВремяПриИзменении(Элемент)
	УстановитьФорматРедактированияВремени();
КонецПроцедуры

&НаКлиенте
Процедура ПользователиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда		
		Возврат;		
	КонецЕсли;	
	
	Пользователи.Очистить();
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
		
		НоваяСтрока = Пользователи.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь;		
			
	КонецЦикла;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияДоступаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДатаОкончанияДоступа = КонецДня(ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Подбор(Команда)
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, Элементы.Пользователи);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступ(Команда)
	
	Отказ = Ложь;
	
	УстановитьДоступНаСервере(Отказ);
	
	Если НЕ Отказ Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Установка времени завершена'"));	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступНаСервере(Отказ)
	
	НачатьТранзакцию();
	
	Для каждого Строка Из Пользователи Цикл
		
		РегистрыСведений.ВремяДоступаПользователейСУО.УстановитьВремяДоступа(Строка.Пользователь, ДатаНачалаДоступа, ДатаОкончанияДоступа, СкрытьВремя, Отказ);
		
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	РегистрыСведений.ВремяДоступаПользователейСУО.ДобавитьОткрытоеОбучениеДляПерепроведения();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ВременнаяТаблицаПользователей = Новый ТаблицаЗначений();
	ВременнаяТаблицаПользователей.Колонки.Добавить("Пользователь");
	ВременнаяТаблицаПользователей.Колонки.Добавить("Наименование");
	
	Для каждого Строка Из Пользователи Цикл
	
		НоваяСтрока = ВременнаяТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Строка.Пользователь;
		НоваяСтрока.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Пользователь, "Наименование");
	
	КонецЦикла;
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ВременнаяТаблицаПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;	
	
КонецФункции

&НаКлиенте
Процедура УстановитьФорматРедактированияВремени()
	
	Если СкрытьВремя Тогда
		Элементы.ДатаНачалаДоступа.ФорматРедактирования = "ДЛФ=D";
		Элементы.ДатаОкончанияДоступа.ФорматРедактирования = "ДЛФ=D";
	Иначе
		Элементы.ДатаНачалаДоступа.ФорматРедактирования = "";
		Элементы.ДатаОкончанияДоступа.ФорматРедактирования = "";
	КонецЕсли;
	
	
КонецПроцедуры






#КонецОбласти
